{
	"Apple___Apple_scab":
	{
		"About" : "Apple Scab is a fungal disease which can affect the leaves, fruit, and twigs of flowering, ornamental trees such as crabapple, hawthorn (Venturia inequalis) and pear (V. pirina).",
		"Cause" : "Apple Scab is caused by the ascomycete fungus Venturia inaequalis.",
		"Cure"  : "For best control, apple scab spray that is liquid copper soap early can be used two weeks before symptoms appear normally. Alternatively, begin the applications when the disease first appears, and repeat it at least seven to ten days' interval till the blossom drops."
	},
	"Apple___Black_rot":
	{
		"About" : "They appear as small, purple specks on the upper surface of the leaves that enlarge into circular lesions 1/8 to 1/4 inch (3-6 mm) in diameter. The margin of the lesions remains purple, while the center turns tan to brown. In a few weeks, secondary enlargement of these leaf spots occurs.",
		"Cause" : "Black rot in apple tree is caused by a bacteria, Xanthomonas campestris pv. campestris, that can infect most crucifer crops at any growth stage. ",
		"Cure"  : "Carefully prune and dispose of dead wood. This should be an important component of both current-season and long-range management.Prune and remove cankers; properly dispose of prunings by burial or burning.Remove all mummified fruit.Control fire blight by pruning out infected wood or controlling insect vectors."
	},
	"Apple___Cedar_apple_rust":
	{
		"About" : "Cedar apple rust (Gymnosporangium juniperi-virginianae) is a fungal disease that requires juniper plants to complete its complicated two year life-cycle. Spores overwinter as a reddish-brown gall on young twigs of various juniper species.",
		"Cause" : "Cedar apple rust is caused by a fungal pathogen called Gymnosporangium juniperi-virginianae. This fungus attacks crabapples and apples (Malus sp.) and eastern red cedar (Juniper) as well as a few other junipers not commonly grown in Illinois. In order to survive, the fungus must move from one type of host to another.",
		"Cure": "rust can be controlled by spraying plants with a copper solution (0.5 to 2.0 oz/ gallon of water) at least four times between late August and late October. Safely treat most fungal and bacterial diseases with SERENADE Garden.Thoroughly spray all parts of the plant, especially new shoots."
	},
	"Apple___healthy":
	{
		"About" : "no disease",
		"Cause" : "no disease",
		"Cure"  : "no disease"
	},
	"Potato___Early_blight":
	{
		"About" : "Early blight is primarily a disease of stressed or senescing plants. Symptoms appear first on the oldest foliage. Affected leaves develop circular to angular dark brown lesions 0.12 to 0.16 inch (3–4 mm) in diameter. Concentric rings often form in lesions to produce characteristic target-board effect. Severely infected leaves turn yellow and drop.",
		"Cause" : "Early blight (EB) is a disease of potato caused by the fungus Alternaria solani. It is found wherever potatoes are grown. The disease primarily affects leaves and stems, but under favorable weather conditions, and if left uncontrolled, can result in considerable defoliation and enhance the chance for tuber infection.",
		"Cure"  : "For best control, apply copper-based fungicides early, two weeks before disease normally appears or when weather forecasts predict a long period of wet weather. Alternatively, begin treatment when disease first appears, and repeat every 7-10 days for as long as needed."
	},
	"Potato___Late_blight":
	{
		"About" : "Late blight is a potentially devastating disease of tomato and potato, infecting leaves, stems,and potato tubers.The disease spreads quickly in fields and can result in total crop failure if untreated.Late blight does not occur every year in Minnesota. Late blight of potato was responsible for the Irish potato famine of the late 1840s.",
		"Cause" : "Late blight is caused by the funguslike oomycete pathogen Phytophthora infestans. This potentially devastating disease can infect potato foliage and tubers at any stage of crop development.",
		"Cure"  : "Late blight is controlled by eliminating cull piles and volunteer potatoes, using proper harvesting and storage practices, and applying fungicides when necessary. Air drainage to facilitate the drying of foliage each day is important."
	},
	"Potato___healthy":
	{
		"About" : "no disease",
		"Cause" : "no disease",
		"Cure"  : "no disease"
	},
	"Tomato___Bacterial_spot":
	{
		"About" : "Bacterial spot of tomato is a potentially devastating disease that, in severe cases, can lead to unmarketable fruit and even plant death.  Bacterial spot can occur wherever tomatoes are grown, but is found most frequently in warm, wet climates, as well as in greenhouses.",
		"Cause" : "Bacterial spot of tomato is caused by Xanthomonas vesicatoria, Xanthomonas euvesicatoria, Xanthomonas gardneri, and Xanthomonas perforans.  These bacterial pathogens can be introduced into a garden on contaminated seed and transplants, which may or may not show symptoms.",
		"Cure"  : "Using pathogen-free seed and disease-free transplants, when possible, is the best way to avoid bacterial spot on tomato. Avoiding sprinkler irrigation and cull piles near greenhouse or field operations, and rotating with a nonhost crop also helps control the disease."
	},
	"Tomato___Early_blight":
	{
		"About" : "Early blight is one of the most common tomato diseases, occurring nearly every season wherever tomatoes are grown.It affects leaves, fruits and stems and can be severely yield limiting when susceptible cultivars are used and weather is favorable. Severe defoliation can occur and result in sunscald on the fruit.Early blight is common in both field and high tunnel tomato production in Minnesota.",
		"Cause" : "Early blight is a common tomato disease caused by the fungus Alternaria solani. It can affect almost all parts of the tomato plants, including the leaves, stems, and fruits.",
		"Cure"  : "Baking soda has fungicidal properties that can stop or reduce the spread of early and late tomato blight. Baking soda sprays typically contain about 1 teaspoon baking soda dissolved into 1 quart of warm water. Adding a drop of liquid dish soap or 2 1/2 tablespoons vegetable oil helps the solution stick to your plant. Pour the mixture into a spray bottle and shake thoroughly before applying to the entire plant. Baking soda fungicides should be applied out of direct sunlight to avoid burning your plant, and do not make it too strong. While baking soda helps fight fungus, too much can damage your plants."
	},
	"Tomato___Late_blight":
	{
		"About" : "Late blight is a potentially devastating disease of tomato and potato, infecting leaves, stems, tomato fruit, and potato tubers. The disease spreads quickly in fields and can result in total crop failure if untreated. Late blight does not occur every year in Minnesota.",
		"Cause" : "Tomato late blight is caused by the oomycete pathogen Phytophthora infestans (P. infestans). The pathogen is best known for causing the devastating Irish potato famine of the 1840s.",
		"Cure"  : "fungicides that contain maneb, mancozeb, chlorothanolil, or fixed copper can help protect plants from late tomato blight. Repeated applications are necessary throughout the growing season as the disease can strike at any time."
	},
	"Tomato___Leaf_Mold":
	{
		"About" : "Tomato leaf mold is typically only an issue in greenhouse and high-tunnel tomatoes.The disease is driven by high relative humidity (greater than 85%).Foliage is often the only part of the plant directly infected. Infection will cause infected leaves to wither and die, indirectly affecting yield.In severe cases, blossoms and fruit can also be infected, directly reducing yield.",
		"Cause" : "Leaf mold is caused by the fungus Passalora fulva (previously called Fulvia fulva or Cladosporium fulvum).",
		"Cure"  : "Use drip irrigation and avoid watering foliage. Use a stake, strings, or prune the plant to keep it upstanding and increase airflow in and around it. Remove and destroy (burn) all plants debris after the harvest."
	},
	"Tomato___Septoria_leaf_spot":
	{
		"About" : "Septoria leaf spot usually appears on the lower leaves after the first fruit sets. Spots are circular, about 1/16 to 1/4 inch in diameter with dark brown margins and tan to gray centers with small black fruiting structures. Characteristically, there are many spots per leaf. This disease spreads upwards from oldest to youngest growth. If leaf lesions are numerous, the leaves turn slightly yellow, then brown, and then wither.",
		"Cause" : "Septoria leaf spot is caused by a fungus, Septoria lycopersici. It is one of the most destructive diseases of tomato foliage and is particularly severe in areas where wet, humid weather persists for extended periods.",
		"Cure"  : "Fungicides. Most fungicides registered for use on tomatoes would effectively control Septoria leaf spot. These include maneb, mancozeb, chlorothalonil, and benomyl. Captan is not effective and zineb may be difficult to purchase."
	},
    "Tomato___Spider_mites Two-spotted_spider_mite":
	{
		"About" : "The tomato red spider mites are pale-orange to red and feed on the underside of leaves. They cannot be seen easily with the naked eye.",
		"Cause" : "spider mites are  caused by sucking sap appears as many shiny pale yellow marks on the top of the tomato leaf . Eventually the leaves turn brown and die or fall off. Severe attack leads to formation of webs on the plant . Red spider mites are difficult but not impossible to control.",
		"Cure"  : "Extension horticulturists currently recommend aiming a hard stream of water at infested plants to knock spider mites off the plants. Other options include insecticidal soaps, horticultural oils, or neem oil."
	},
	"Tomato___Target_Spot":
	{
		"About" : "The disease starts on the older leaves and spreads upwards. The first signs are irregular-shaped spots (less than 1 mm) with a yellow margin.",
		"Cause" : "Target spot of tomato often causes necrotic lesions in a concentric pattern, similar to early blight. Target spot of tomato is favored by temperatures of 68 to 82°F and leaf wetness periods as long as 16 hours. The target spot fungus can survive in host residue for a period.",
		"Cure"  : "Warm wet conditions favour the disease such that fungicides are needed to give adequate control. The products to use are chlorothalonil, copper oxychloride or mancozeb. Treatment should start when the first spots are seen and continue at 10-14-day intervals until 3-4 weeks before last harvest."
	},
	"Tomato___Tomato_Yellow_Leaf_Curl_Virus":
	{
		"About" : "The most obvious symptoms in tomato plants are small leaves that become yellow between the veins. The leaves also curl upwards and towards the middle of the leaf.The virus is not known to be seedborne or to be transmitted mechanically.",
		"Cause" : "Tomato yellow leaf curl virus (TYLCV) is a DNA virus from the genus Begomovirus and the family Geminiviridae.",
		"Cure"  : "Use a neonicotinoid insecticide, such as dinotefuran (Venom) imidacloprid (AdmirePro, Alias, Nuprid, Widow, and others) or thiamethoxam (Platinum), as a soil application or through the drip irrigation system at transplanting of tomatoes."
	},
    "Tomato___Tomato_mosaic_virus":
	{
		"About" : "The foliage of affected tomato plants shows mottling, with alternating yellowish and darker green areas, the latter often appearing thicker and raised giving a blister-like appearance. The leaves tend to be fern-like in appearance with pointed tips and younger leaves may be twisted.",
		"Cause" : "The disease is spread into the plant via small wounds caused by mechanical injury, insect chewing, and grafting. Leftover plant debris is the most common contagion.",
		"Cure"  : "Once plants are infected, there is no cure for mosaic viruses. Because of this, prevention is key! However, if plants in your garden do show symptoms of having mosaic viruses, here's how to minimize the damage: Remove all infected plants and destroy them."
	},
	"Tomato___healthy":
	{
		"About" : "no disease",
		"Cause" : "no disease",
		"Cure"  : "no disease"
	}
}	
